In [1]:
import pandas as pd

df = pd.read_csv("2024_01_input.txt", sep="   ", header=None, engine="python")
df.columns = ["left", "right"]
df

      left  right
0    88159  51481
1    66127  31794
2    71500  84893
3    59372  58807
4    97356  27409
..     ...    ...
995  38711  37490
996  90949  42627
997  82510  25811
998  21910  29845
999  38235  16463

[1000 rows x 2 columns]

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   left    1000 non-null   int64
 1   right   1000 non-null   int64
dtypes: int64(2)
memory usage: 15.8 KB

Part 1

In [3]:
lst1 = df.loc[:, "left"]
lst2 = df.loc[:, "right"]

In [4]:
lst1_sorted = lst1.sort_values().reset_index(drop=True)
lst2_sorted = lst2.sort_values().reset_index(drop=True)

In [5]:
print(lst1_sorted)
print(lst2_sorted)

0      10153
1      10262
2      10396
3      10498
4      10669
       ...
995    99416
996    99523
997    99724
998    99750
999    99768
Name: left, Length: 1000, dtype: int64
0      10159
1      10270
2      10520
3      11160
4      11212
       ...
995    98652
996    99077
997    99189
998    99346
999    99616
Name: right, Length: 1000, dtype: int64

In [6]:
abs(lst1_sorted - lst2_sorted).sum()

np.int64(1579939)

Part Two

In [7]:
df

      left  right
0    88159  51481
1    66127  31794
2    71500  84893
3    59372  58807
4    97356  27409
..     ...    ...
995  38711  37490
996  90949  42627
997  82510  25811
998  21910  29845
999  38235  16463

[1000 rows x 2 columns]

In [9]:
right_counts = df["right"].value_counts()
right_counts

right
60615    20
41572    19
37490    19
58940    18
58807    17
         ..
21122     1
97896     1
42627     1
25811     1
37396     1
Name: count, Length: 663, dtype: int64

In [10]:
filtered_counts = right_counts[right_counts.index.isin(df["left"])]
filtered_counts

right
60615    20
41572    19
37490    19
58940    18
58807    17
28807    16
12446    16
64123    16
29845    15
85693    15
51481    15
61602    14
89651    13
90912    13
30124    12
91399    12
50581    12
69088    11
21742    11
55130    10
82862    10
40284     9
30263     9
65493     8
60158     7
47024     6
29057     6
68978     5
77305     4
94484     4
63653     3
79880     3
81626     2
68926     1
Name: count, dtype: int64

In [11]:
(filtered_counts.index * filtered_counts.values).values.sum()

np.int64(20351745)